Benchmark_tests/ycsb/workloadB/thread_32.txt
Adding shard node URL: jdbc:mysql://35.188.80.11:3306/database_2
Adding shard node URL: jdbc:mysql://35.188.80.11:3306/database_2
Adding shard node URL: jdbc:mysql://35.188.80.11:3306/database_2
[...]
Using shards: 1, batchSize:1000, fetchSize: 1000
Using shards: 1, batchSize:1000, fetchSize: 1000
Using shards: 1, batchSize:1000, fetchSize: 1000
[...]
[OVERALL], RunTime(ms), 35633
[OVERALL], Throughput(ops/sec), 28.06387337580333
[TOTAL_GCS_G1_Young_Generation], Count, 3
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 35
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.09822355681531166
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 3
[TOTAL_GC_TIME], Time(ms), 35
[TOTAL_GC_TIME_%], Time(%), 0.09822355681531166
[READ], Operations, 956
[READ], AverageLatency(us), 521766.6945606695
[READ], MinLatency(us), 310528
[READ], MaxLatency(us), 1048063
[READ], 95thPercentileLatency(us), 887807
[READ], 99thPercentileLatency(us), 1023999
[READ], Return=OK, 956
[CLEANUP], Operations, 32
[CLEANUP], AverageLatency(us), 792792.0
[CLEANUP], MinLatency(us), 652800
[CLEANUP], MaxLatency(us), 1310719
[CLEANUP], 95thPercentileLatency(us), 895999
[CLEANUP], 99thPercentileLatency(us), 1310719
[UPDATE], Operations, 44
[UPDATE], AverageLatency(us), 1447906.9090909092
[UPDATE], MinLatency(us), 318208
[UPDATE], MaxLatency(us), 13647871
[UPDATE], 95thPercentileLatency(us), 9347071
[UPDATE], 99thPercentileLatency(us), 13647871
[UPDATE], Return=OK, 44